danielac32/stm32f4_core_bootloader_411/usb/msc/msc.c

#include <interrupt.h>
#include <stdint.h>
#include <stdio.h>
#include <stdbool.h>
#include <string.h>
#include <stm32.h>
#include <memory.h>
#include <kernel.h>
#include <delay.h>
#include <gpio.h>
#include <uart.h>
#include <process.h>
#include <usb.h>
#include "usb-msc.h"
#include "sd-spi.h"
#include <w25qxxx.h>

extern const sd_card_drv_t sd_card_drv;
extern const w25qxxx_drv_t w25qxxx_drv;

#define USBD_FULL_SPEED
#if 1
//--------------------------------------------
#define MSC_EP0_SIZE    64
#define MSC_RXD_EP      0x01
#define MSC_TXD_EP      0x82
#ifdef USBD_FULL_SPEED
#define MSC_DATA_SZ     64
#else
#define MSC_DATA_SZ     512
#endif
#define SECTOR_SIZE     512

typedef struct msc_config
{
    struct usb_config_descriptor        config;
    struct usb_interface_descriptor     comm;
    struct usb_endpoint_descriptor      data_eprx;
    struct usb_endpoint_descriptor      data_eptx;
} msc_config_t;






static const struct usb_device_descriptor device_desc =
{
    .bLength            = sizeof(struct usb_device_descriptor),
    .bDescriptorType    = USB_DTYPE_DEVICE,
    .bcdUSB             = CPU_TO_LE16(VERSION_BCD(2,0,0)),
    .bDeviceClass       = USB_CLASS_PER_INTERFACE,
    .bDeviceSubClass    = USB_SUBCLASS_NONE,
    .bDeviceProtocol    = USB_PROTO_NONE,
    .bMaxPacketSize0    = MSC_EP0_SIZE,
    .idVendor           = CPU_TO_LE16(0x0483),
    .idProduct          = CPU_TO_LE16(0x5740),
    .bcdDevice          = CPU_TO_LE16(VERSION_BCD(1,0,0)),
    .iManufacturer      = 1,
    .iProduct           = 2,
    .iSerialNumber      = INTSERIALNO_DESCRIPTOR,
    .bNumConfigurations = 1,
};
//--------------------------------------------
static const msc_config_t config_desc =
{
    .config =
    {
        .bLength                = sizeof(struct usb_config_descriptor),
        .bDescriptorType        = USB_DTYPE_CONFIGURATION,
        .wTotalLength           = CPU_TO_LE16(sizeof(msc_config_t)),
        .bNumInterfaces         = 1,
        .bConfigurationValue    = 1,
        .iConfiguration         = NO_DESCRIPTOR,
        .bmAttributes           = USB_CFG_ATTR_RESERVED | USB_CFG_ATTR_SELFPOWERED,
        .bMaxPower              = USB_CFG_POWER_MA(100),
    },
    .comm =
    {
        .bLength                = sizeof(struct usb_interface_descriptor),
        .bDescriptorType        = USB_DTYPE_INTERFACE,
        .bInterfaceNumber       = 0,
        .bAlternateSetting      = 0,
        .bNumEndpoints          = 2,
        .bInterfaceClass        = USB_CLASS_MASS_STORAGE,
        .bInterfaceSubClass     = USB_MSC_SUBCLASS_SCSI,
        .bInterfaceProtocol     = USB_MSC_PROTO_BULKONLY,
        .iInterface             = NO_DESCRIPTOR,
    },
    .data_eprx =
    {
        .bLength                = sizeof(struct usb_endpoint_descriptor),
        .bDescriptorType        = USB_DTYPE_ENDPOINT,
        .bEndpointAddress       = MSC_RXD_EP,
        .bmAttributes           = USB_EPTYPE_BULK,
        .wMaxPacketSize         = CPU_TO_LE16(MSC_DATA_SZ),
        .bInterval              = 0,
    },
    .data_eptx =
    {
        .bLength                = sizeof(struct usb_endpoint_descriptor),
        .bDescriptorType        = USB_DTYPE_ENDPOINT,
        .bEndpointAddress       = MSC_TXD_EP,
        .bmAttributes           = USB_EPTYPE_BULK,
        .wMaxPacketSize         = CPU_TO_LE16(MSC_DATA_SZ),
        .bInterval              = 0,
    },
};

//--------------------------------------------
static const struct usb_string_descriptor lang_desc = USB_ARRAY_DESC(USB_LANGID_ENG_US);
static const struct usb_string_descriptor manuf_desc_en = USB_STRING_DESC("Homemcu firmware examples");
static const struct usb_string_descriptor prod_desc_en = USB_STRING_DESC("MSC sd-card demo");
static const struct usb_string_descriptor *const dtable[] =
{
    &lang_desc,
    &manuf_desc_en,
    &prod_desc_en,
};

 

//--------------------------------------------
static const db_inquiry_t db_inquiry =
{
    0x00, // PERIPHERAL QUALIFIER = 0, PERIPHERAL DEVICE TYPE = 0 (Direct access block device SBC-3)
    0x80, // RMB = 1 (Removable media), LU_CONG = 0 (Logical unit is not part of a logical unit conglomerate)
    0x04, // The device server complies to SPC-2
    0x02, // The response data format complies to SPC-2/3/4
    0x1F, // ADDITIONAL LENGTH = sizeof(scsi_std_inquiry) - 5
    0x00, // SCCS = 0, ACC = 0, TPGS = 0, PROTECT = 0
    0x00, // ENCSERV = 0, VS(Vendor Specific) = 0, MULTIP = 0
    0x00, // CMDQUE = 0, VS(Vendor Specific) = 0
    "STM     ", // T10 VENDOR IDENTIFICATION
    "Mass Storage    ", // PRODUCT IDENTIFICATION
    "0001" // PRODUCT REVISION LEVEL
};

// Information technology - SCSI Block Commands – 3 (SBC-3) Revision 25 27 October 2010
// 6.4.1 Mode parameters overview
static const db_mode_sence_6_t db_mode_sence_6 =
{
    0x03, // The number of bytes that follow
    0x00, // The MEDIUM TYPE field in the mode parameter header (see SPC-4) shall be set to 00h
    0x00, // WP = 0 (not write-protected), DPOFUA = 0
    0x00  // No block descriptors in the mode parameter list
};

// Information technology - SCSI Block Commands – 3 (SBC-3) Revision 25 27 October 2010
// 6.4.1 Mode parameters overview
static const db_mode_sence_10_t db_mode_sence_10 =
{
    { 0x00, 0x06, }, // The number of bytes that follow
    0x00, // The MEDIUM TYPE field in the mode parameter header (see SPC-4) shall be set to 00h
    0x00, // WP = 0 (not write-protected), DPOFUA = 0
    0x00, // LONGLBA = 0
    0x00, // Reserved
    { 0x00, 0x00 }, // No block descriptors in the mode parameter list
};

//--------------------------------------------
typedef enum bot_state
{
    bot_idle = 0,
    bot_data,
    bot_data_read,
    bot_data_write,
    bot_csw
} bote_state_t;

typedef struct bot
{
    uint8_t max_lun;
    bote_state_t state;
    usb_msc_bot_cbw_t cbw;
    usb_msc_bot_csw_t csw;
    uint32_t buff[(SECTOR_SIZE + 3) / sizeof(uint32_t)];
    uint32_t fpos;
    uint32_t lba;
    uint32_t lbn;
    uint8_t sence_key;
    uint8_t asc;
} bot_t;

