danielac32/stm32f4_core_bootloader_411/usb/msc/msc.c
//--------------------------------------------
static usbd_device udev;
static bot_t bot;
// Due to use with USB FIFO and/or DMA, the data buffers below must be 32-bit aligned:
#define USB_CTRL_BUFF_SZ 32
static uint32_t ubuf[(USB_CTRL_BUFF_SZ + 3) / sizeof(uint32_t)];

//--------------------------------------------
static usbd_respond msc_getdesc(usbd_ctlreq *req, void **address, uint16_t *length)
{
    uint8_t dtype = req->wValue >> 8;
    uint8_t dnumber = req->wValue;
    const void* desc;
    uint16_t len = 0;

    switch (dtype)
    {
    case USB_DTYPE_DEVICE:
        desc = &device_desc;
        break;
    case USB_DTYPE_CONFIGURATION:
        desc = &config_desc;
        len = sizeof(config_desc);
        break;
    case USB_DTYPE_STRING:
        if (dnumber < sizeof(dtable) / sizeof(dtable[0]))
        {
            desc = dtable[dnumber];
        }
        else
        {
            kprintf("error msc_getdesc\n");
            return usbd_fail;
        }
        break;
    default:
        kprintf("error msc_getdesc 2\n");
        return usbd_fail;
    }
    if (len == 0)
    {
        len = ((struct usb_header_descriptor*)desc)->bLength;
    }
    *address = (void*)desc;
    *length = len;
    return usbd_ack;
};

//--------------------------------------------
static usbd_respond msc_control(usbd_device *dev, usbd_ctlreq *req, usbd_rqc_callback *callback)
{
    if (((USB_REQ_RECIPIENT | USB_REQ_TYPE) & req->bmRequestType) != (USB_REQ_INTERFACE | USB_REQ_CLASS))
    {
        return usbd_fail;
    }
    switch (req->bRequest)
    {
    case USB_MSC_BOT_GET_MAX_LUN:
        dev->status.data_ptr = &bot.max_lun;
        dev->status.data_count = 1;
        return usbd_ack;
    case USB_MSC_BOT_RESET:
        memset(&bot, 0, sizeof(bot));
        return usbd_ack;
    default:
        kprintf("error msc_control\n");
        return usbd_fail;
    }
}

//--------------------------------------------
static void bot_tx(usbd_device *dev)
{
    int32_t len;

    switch (bot.state)
    {
    case bot_data:
        len = usbd_ep_write(dev, MSC_TXD_EP, bot.buff, (bot.fpos < MSC_DATA_SZ) ? bot.fpos : MSC_DATA_SZ);
        if (len > 0)
        {
            memmove(bot.buff, (uint8_t *)bot.buff + len, bot.fpos - len);
            bot.fpos -= len;
            if (bot.fpos == 0)
            {
                bot.state = bot_csw;
            }
        }
        break;
    case bot_data_read:
        if (bot.fpos == 0)
        {
            sd_error err;
            do
            {
                err = w25qxxx_drv.read((uint8_t *)bot.buff, bot.lba, 1);
            }
            while (err == sd_err_wrong_status);
            bot.lba++;
            bot.lbn--;
            bot.fpos = sizeof(bot.buff);
        }
        len = usbd_ep_write(dev, MSC_TXD_EP, bot.buff, (bot.fpos < MSC_DATA_SZ) ? bot.fpos : MSC_DATA_SZ);
        if (len > 0)
        {
            memmove(bot.buff, (uint8_t *)bot.buff + len, bot.fpos - len);
            bot.fpos -= len;
        }
        if (!bot.lbn && !bot.fpos)
        {
            bot.csw.dDataResidue = 0;
            bot.csw.bStatus = USB_MSC_BOT_CSW_CMD_PASSED;
            bot.state = bot_csw;
        }
        break;
    case bot_csw:
        len = usbd_ep_write(dev, MSC_TXD_EP, &bot.csw, sizeof(bot.csw));
        bot.state = bot_idle;
        break;
    default:
        break;
    }
}

//--------------------------------------------
static void bot_error(usbd_device *dev, uint8_t sence_key, uint8_t asc)
{
    bot.sence_key = sence_key;
    bot.asc = asc;

    bot.state = bot_csw;
    bot.csw.dDataResidue = 0;
    bot.csw.bStatus = USB_MSC_BOT_CSW_CMD_FAILED;
    bot_tx(dev);
}

//--------------------------------------------
static void bot_rx(usbd_device *dev)
{
    int32_t len;
    uint32_t alloc_len;

    switch (bot.state)
    {
    case bot_idle:
        len = usbd_ep_read(dev, MSC_RXD_EP, bot.buff, MSC_DATA_SZ);
        if (len != sizeof(struct usb_msc_bot_cbw))
        {
            bot.sence_key = ILLEGAL_REQUEST;
            bot.asc = INVALID_COMMAND_OPERATION_CODE;
            usbd_ep_stall(dev, MSC_RXD_EP);
            return;
        }
        memcpy(&bot.cbw, bot.buff, sizeof(struct usb_msc_bot_cbw));
        if ((bot.cbw.dSignature != USB_MSC_BOT_CBW_SIGNATURE) ||
            (bot.cbw.bCBLength < 1) ||
            (bot.cbw.bCBLength > 16))
        {
            bot.sence_key = ILLEGAL_REQUEST;
            bot.asc = INVALID_COMMAND_OPERATION_CODE;
            usbd_ep_stall(dev, MSC_RXD_EP);
            return;
        }
        bot.csw.dSignature = 0x53425355;
        bot.csw.dTag = bot.cbw.dTag;
        switch (bot.cbw.CB[0])
        {
        case SCSI_INQUIRY:
            {
                cdb_inquiry_t *cdb;

                cdb = (cdb_inquiry_t *)bot.cbw.CB;
                alloc_len = (uint32_t)(cdb->allocation_length[0] << 8 | cdb->allocation_length[1]);
                if (!(cdb->evpd & 0x01))
                {
                    if (!cdb->page_code)
                    {
                        bot.fpos = (alloc_len < sizeof(db_inquiry)) ? alloc_len : sizeof(db_inquiry);
                        memcpy(bot.buff, &db_inquiry, bot.fpos);
                        bot.state = bot_data;
                        bot.csw.dDataResidue = bot.cbw.dDataTransferLength - bot.fpos;
                        bot.csw.bStatus = USB_MSC_BOT_CSW_CMD_PASSED;
                        bot_tx(dev);
                    }
                    else
                    {
                        bot_error(dev, ILLEGAL_REQUEST, INVALID_FIELD_IN_CDB);
                    }
                }
                else
                {
                    bot_error(dev, ILLEGAL_REQUEST, INVALID_FIELD_IN_CDB);
                }

                break;
            }
        case SCSI_REQUEST_SENSE:
            {
                cdb_request_sence_t *cdb;
                db_request_sence_t db = { 0 };

                cdb = (cdb_request_sence_t *)bot.cbw.CB;
                alloc_len = (uint32_t)(cdb->allocation_length);

                db.response_code = 0x70;
                db.sence_key = bot.sence_key;
                db.additional_sence_length = 10;
                db.additional_sence_code = bot.asc;

