danielac32/stm32f4_core_bootloader_411/usb/msc/msc.c
                bot.fpos = (alloc_len < sizeof(db)) ? alloc_len : sizeof(db);
                memcpy(bot.buff, &db, bot.fpos);
                bot.state = bot_data;
                bot.csw.dDataResidue = bot.cbw.dDataTransferLength - bot.fpos;
                bot.csw.bStatus = USB_MSC_BOT_CSW_CMD_PASSED;
                bot_tx(dev);

                break;
            }
        case SCSI_MODE_SENSE_6:
            {
                bot.fpos = sizeof(db_mode_sence_6);
                memcpy(bot.buff, &db_mode_sence_6, bot.fpos);
                bot.state = bot_data;
                bot.csw.dDataResidue = bot.cbw.dDataTransferLength - bot.fpos;
                bot.csw.bStatus = USB_MSC_BOT_CSW_CMD_PASSED;
                bot_tx(dev);

                break;
            }
        case SCSI_MODE_SENSE_10:
            {
                bot.fpos = sizeof(db_mode_sence_10);
                memcpy(bot.buff, &db_mode_sence_10, bot.fpos);
                bot.state = bot_data;
                bot.csw.dDataResidue = bot.cbw.dDataTransferLength - bot.fpos;
                bot.csw.bStatus = USB_MSC_BOT_CSW_CMD_PASSED;
                bot_tx(dev);

                break;
            }
        case SCSI_TEST_UNIT_READY:
            {
                bot.state = bot_csw;
                bot.csw.dDataResidue = 0;
                bot.csw.bStatus = USB_MSC_BOT_CSW_CMD_PASSED;
                bot_tx(dev);

                break;
            }
        case SCSI_READ_CAPACITY_10:
            {
                cdb_read_capacity_10_t *cdb;
                db_read_capacity_10_t db = { 0 };
                flash_info_t *flash_info;//sd_info_t *sd_info;

                cdb = (cdb_read_capacity_10_t *)bot.cbw.CB;
                flash_info = w25qxxx_drv.getcardinfo();
                bot.lba = cdb->logical_block_address[0] << 24 |
                          cdb->logical_block_address[1] << 16 |
                          cdb->logical_block_address[2] << 8 |
                          cdb->logical_block_address[3];
                if (bot.lba > flash_info->card_size - 1)
                {
                    bot_error(dev, ILLEGAL_REQUEST, LOGICAL_BLOCK_ADDRESS_OUT_OF_RANGE);
                    break;
                }
                if ((cdb->pmi & 0x01) && !bot.lba)
                {
                    bot_error(dev, ILLEGAL_REQUEST, INVALID_FIELD_IN_CDB);
                    break;
                }

                db.logical_block_address[0] = (flash_info->card_size - 1) >> 24;
                db.logical_block_address[1] = (flash_info->card_size - 1) >> 16;
                db.logical_block_address[2] = (flash_info->card_size - 1) >> 8;
                db.logical_block_address[3] = (flash_info->card_size - 1);
                db.logical_block_length[0] = flash_info->sect_size >> 24;
                db.logical_block_length[1] = flash_info->sect_size >> 16;
                db.logical_block_length[2] = flash_info->sect_size >> 8;
                db.logical_block_length[3] = flash_info->sect_size;

                bot.fpos = sizeof(db);
                memcpy(bot.buff, &db, bot.fpos);
                bot.state = bot_data;
                bot.csw.dDataResidue = bot.cbw.dDataTransferLength - bot.fpos;
                bot.csw.bStatus = USB_MSC_BOT_CSW_CMD_PASSED;
                bot_tx(dev);

                break;
            }
        case SCSI_READ_10:
            {
                cdb_read_10_t *cdb;
                flash_info_t *flash_info;//sd_info_t *sd_info;

                cdb = (cdb_read_10_t *)bot.cbw.CB;
                flash_info = w25qxxx_drv.getcardinfo();
                bot.lba = cdb->logical_block_address[0] << 24 |
                          cdb->logical_block_address[1] << 16 |
                          cdb->logical_block_address[2] << 8 |
                          cdb->logical_block_address[3];
                bot.lbn = cdb->transfer_length[0] << 8 |
                          cdb->transfer_length[1];
                if (bot.lba > flash_info->card_size - 1)
                {
                    bot_error(dev, ILLEGAL_REQUEST, LOGICAL_BLOCK_ADDRESS_OUT_OF_RANGE);
                    break;
                }
                if (cdb->bit_fields & 0xE0)
                {
                    bot_error(dev, ILLEGAL_REQUEST, INVALID_FIELD_IN_CDB);
                    break;
                }
                if (bot.cbw.dDataTransferLength != bot.lbn * flash_info->sect_size)
                {
                    bot_error(dev, ILLEGAL_REQUEST, INVALID_COMMAND_OPERATION_CODE);
                    break;
                }

                bot.state = bot_data_read;
                bot_tx(dev);

                break;
            }
        case SCSI_WRITE_10:
            {
                cdb_write_10_t *cdb;
                flash_info_t *flash_info;//sd_info_t *sd_info;

                cdb = (cdb_write_10_t *)bot.cbw.CB;
                flash_info = w25qxxx_drv.getcardinfo();
                bot.lba = cdb->logical_block_address[0] << 24 |
                          cdb->logical_block_address[1] << 16 |
                          cdb->logical_block_address[2] << 8 |
                          cdb->logical_block_address[3];
                bot.lbn = cdb->transfer_length[0] << 8 |
                          cdb->transfer_length[1];
                if (bot.lba > flash_info->card_size - 1)
                {
                    bot_error(dev, ILLEGAL_REQUEST, LOGICAL_BLOCK_ADDRESS_OUT_OF_RANGE);
                    break;
                }
                if (cdb->bit_fields & 0xE0)
                {
                    bot_error(dev, ILLEGAL_REQUEST, INVALID_FIELD_IN_CDB);
                    break;
                }
                if (bot.cbw.dDataTransferLength != bot.lbn * flash_info->sect_size)
                {
                    bot_error(dev, ILLEGAL_REQUEST, INVALID_COMMAND_OPERATION_CODE);
                    break;
                }

                bot.fpos = 0;
                bot.state = bot_data_write;

                break;
            }
        case SCSI_VERIFY_10:
            {
                cdb_verify_10_t *cdb;
                flash_info_t *flash_info;//sd_info_t *sd_info;

