danielac32/stm32f4_core_bootloader_411/usb/msc/msc.c
                cdb = (cdb_verify_10_t *)bot.cbw.CB;
                flash_info = w25qxxx_drv.getcardinfo();
                bot.lba = cdb->logical_block_address[0] << 24 |
                          cdb->logical_block_address[1] << 16 |
                          cdb->logical_block_address[2] << 8 |
                          cdb->logical_block_address[3];
                if (bot.lba > flash_info->card_size - 1)
                {
                    bot_error(dev, ILLEGAL_REQUEST, LOGICAL_BLOCK_ADDRESS_OUT_OF_RANGE);
                    break;
                }
                if (cdb->bit_fields & 0x02)
                {
                    bot_error(dev, ILLEGAL_REQUEST, INVALID_FIELD_IN_CDB);
                    break;
                }

                bot.state = bot_csw;
                bot.csw.dDataResidue = 0;
                bot.csw.bStatus = USB_MSC_BOT_CSW_CMD_PASSED;
                bot_tx(dev);

                break;
            }
        case SCSI_READ_FORMAT_CAPACITIES:
            {
                cdb_read_format_capacities_t *cdb;
                db_read_format_capacities_t db = { 0 };
                flash_info_t *flash_info;//sd_info_t *sd_info;

                cdb = (cdb_read_format_capacities_t *)bot.cbw.CB;
                alloc_len = (uint32_t)(cdb->allocation_length[0] << 8 | cdb->allocation_length[1]);
                flash_info = w25qxxx_drv.getcardinfo();

                db.capacity_list_length = 8;
                db.number_of_blocks[0] = flash_info->card_size >> 24;
                db.number_of_blocks[1] = flash_info->card_size >> 16;
                db.number_of_blocks[2] = flash_info->card_size >> 8;
                db.number_of_blocks[3] = flash_info->card_size;
                db.descriptor_type = 0x02;
                db.block_length[0] = flash_info->sect_size >> 16;
                db.block_length[1] = flash_info->sect_size >> 8;
                db.block_length[2] = flash_info->sect_size;

                bot.fpos = (alloc_len < sizeof(db)) ? alloc_len : sizeof(db);
                memcpy(bot.buff, &db, bot.fpos);
                bot.state = bot_data;
                bot.csw.dDataResidue = bot.cbw.dDataTransferLength - bot.fpos;
                bot.csw.bStatus = USB_MSC_BOT_CSW_CMD_PASSED;
                bot_tx(dev);

                break;
            }
        case SCSI_PREVENT_ALLOW_MEDIUM_REMOVAL:
            {
                bot.state = bot_csw;
                bot.csw.dDataResidue = 0;
                bot.csw.bStatus = USB_MSC_BOT_CSW_CMD_PASSED;
                bot_tx(dev);

                break;
            }
        case SCSI_START_STOP_UNIT:
            {
                bot.state = bot_csw;
                bot.csw.dDataResidue = 0;
                bot.csw.bStatus = USB_MSC_BOT_CSW_CMD_PASSED;
                bot_tx(dev);

                break;
            }
        default:
            {
                bot_error(dev, ILLEGAL_REQUEST, INVALID_COMMAND_OPERATION_CODE);

                break;
            }
        }
        break;
    case bot_data_write:
        len = usbd_ep_read(dev, MSC_RXD_EP, (uint8_t *)bot.buff + bot.fpos, MSC_DATA_SZ);
        bot.fpos += len;
        if (bot.fpos == sizeof(bot.buff))
        {
            sd_error err;
            do
            {
                err = w25qxxx_drv.write((uint8_t *)bot.buff, bot.lba, 1);
            }
            while (err == sd_err_wrong_status);
            bot.fpos = 0;
            bot.lba++;
            bot.lbn--;
            if (!bot.lbn)
            {
                bot.state = bot_csw;
                bot.csw.dDataResidue = 0;
                bot.csw.bStatus = USB_MSC_BOT_CSW_CMD_PASSED;
                bot_tx(dev);
            }
        }
        break;
    default:
        break;
    }
}

//--------------------------------------------
static void bot_callback(usbd_device *dev, uint8_t event, uint8_t ep)
{
    switch (event)
    {
    case usbd_evt_eptx:
        bot_tx(dev);
        break;
    case usbd_evt_eprx:
        bot_rx(dev);
        break;
    default:
        break;
    }
}

//--------------------------------------------
static usbd_respond msc_setconf(usbd_device *dev, uint8_t cfg)
{
    switch (cfg)
    {
    case 0:
        // deconfiguring device
        usbd_ep_deconfig(dev, MSC_RXD_EP);
        usbd_ep_deconfig(dev, MSC_TXD_EP);
        usbd_reg_endpoint(dev, MSC_RXD_EP, NULL);
        usbd_reg_endpoint(dev, MSC_TXD_EP, NULL);
        return usbd_ack;
    case 1:
        // configuring device
        usbd_ep_config(dev, MSC_RXD_EP, USB_EPTYPE_BULK, MSC_DATA_SZ);
        usbd_ep_config(dev, MSC_TXD_EP, USB_EPTYPE_BULK | USB_EPTYPE_DBLBUF, MSC_DATA_SZ);
        usbd_reg_endpoint(dev, MSC_RXD_EP, bot_callback);
        usbd_reg_endpoint(dev, MSC_TXD_EP, bot_callback);
        return usbd_ack;
    default:
        return usbd_fail;
    }
}

void check_msc(){
    if (!hw_get_pin(GPIOx(GPIO_A),0)){

        #if 0
        sd_card_drv.init();
        sd_card_drv.reset();
        sd_info_t *sd_info;
        sd_info = sd_card_drv.getcardinfo();
        #else
        w25qxxx_drv.init();
        //w25qxxx_drv.reset();
        flash_info_t *flash_info;
        flash_info = w25qxxx_drv.getcardinfo();

        #endif

        //kprintf("size card: %d sector: %d\n",sd_info->card_size*sd_info->sect_size,sd_info->sect_size);
        usbd_hw_init(&udev);
        usbd_init(&udev, &usbd_hw, MSC_EP0_SIZE, ubuf, sizeof(ubuf));
        usbd_reg_control(&udev, msc_control);
        usbd_reg_config(&udev, msc_setconf);
        usbd_reg_descr(&udev, msc_getdesc);
        usbd_enable(&udev, true);
        usbd_connect(&udev, true); 
        while (1){
            usbd_poll(&udev);
        }
    }

}

 

#endif



